title: Suspicious EventCacheManager Scheduled Task Creation
status: stable
description: Detects the attempt to create scheduled task named "EventCacheManager" via schtasks. This technique was used for persistence in sunburst attack.
author: Picus Security
references:
   - https://attack.mitre.org/techniques/T1053/005/
   - https://attack.mitre.org/tactics/TA0004/
   - https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/
logsource:
    product: windows
    service: security
    definition1: 'Requirements: Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit Policies\Detailed Tracking\Audit Process Creation'
    definition2: 'Requirements: Group Policy : Computer Configuration\ Administrative Templates\ System\ Audit Process Creation\ Include Command Line'
detection:
    selection:
        EventID: 4688
        NewProcessName: '*\schtasks.exe'
        ProcessCommandLine|contains|all: 
            - 'create'
            - 'EventCacheManager'
            - 'Microsoft\Windows\SoftwareProtectionPlatform'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.persistence
    - attack.ta0004
    - attack.t1053.005
