title: Persistence by Adding a User to Local Administrator Group
status: stable
description: Detects adding a user to Local Administrators Group. This technique is commonly utilized for persistence and privilege escalation.
author: Picus Security
references:
   - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4732
   - https://attack.mitre.org/techniques/T1136/
   - https://attack.mitre.org/tactics/TA0003/
logsource:
    product: windows
    service: security
    definition1: 'Requirements: Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Account Management\Audit Security Group Management'
detection:
    selection:
        EventID: 4732
    selection1:   
        GroupName: 'Administrators'
    selection2:
        SecurityID: 'S-1-5-32-544'
    condition: selection and (selection1 or selection2)
falsepositives:
    - Legitimate administrative activities
level: high
tags:
    - attack.persistence
    - attack.t1136
    - attack.ta0003