title: Script File Execution via WScript or CScript Tool
status: stable
description: Detects the attempt to execute scripts such as VBScript, JavaScript files via WScript or CScript tool. This method is used for bypassing process monitoring mechanisms.
author: Picus Security
references:
   - https://attack.mitre.org/techniques/T1059/005/
   - https://attack.mitre.org/techniques/T1059/007/
   - https://attack.mitre.org/tactics/TA0002/
   - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wscript
   - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/cscript
logsource:
    product: windows
    service: security
    definition1: 'Requirements: Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit Policies\Detailed Tracking\Audit Process Creation'
    definition2: 'Requirements: Group Policy : Computer Configuration\ Administrative Templates\ System\ Audit Process Creation\ Include Command Line'
detection:
    selection:
        EventID: 4688
        NewProcessName: 
          - '*\cscript.exe'
          - '*\wscript.exe'
        ProcessCommandLine: 
          - '*.vbs*'
          - '*.js*'
          - '*//E:jscript*'
          - '*//E:vbscript*'
    condition: selection
falsepositives:
    - Administrative tools/scripts
level: medium
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
    - attack.ta0002